---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.HasDesignParts
zh: 系统
source: html/2eeb83d4-64d1-a6b7-9116-9b687037406a.htm
---
# Autodesk.Revit.DB.MEPSystem.HasDesignParts Property

**中文**: 系统

Indicates if the system has one or more design parts.

## Syntax (C#)
```csharp
public bool HasDesignParts { get; }
```